devops-munit-howto_1.0.0/devops-howto_1.0.0/target/test-classes/SetMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.mulesoft.com/schemas/Mule/Schema.xsd"><soapenv:Header/><soapenv:Body><sch:getLoanRequest xmlns:sch="http://www.mulesoft.com/schemas/Mule/Schema.xsd"><sch:loanId>102</sch:loanId></sch:getLoanRequest></soapenv:Body></soapenv:Envelope>
